
def get_data():
    
    return f"{input('Введите фамилию: ')} {input('Введите имя: ')} {input('Введите класс: ')} {input('Успеваемость: ')}\n"
def get_choice():
    return input('Выберите номер категории\n \
        где: 1-показать все фамилии\n \
             2-показать все имена\n \
             3-показать все № классов\n \
             4-показать учеников выбранного класса\n \
             5-показать всю таблицу\n \
             6-показать информацию по ученику\n \
             7-добавить ученика\n \
             8-показать учеников по успеваемости\n \
             9-выход\n ')    