# 2.Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

lst = [3,4,7,6,2,5,7]
if len(lst)%2 ==0:
    res = list(map(lambda x: lst[x]* lst[len(lst)-1 -x] , range(len(lst)//2)))
else:
    res = list(map(lambda x: lst[x]* lst[len(lst)-1 -x] , range(len(lst)//2+1)))

print(res)